Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi
This class provides methods to interact with the Bim Model Data Product API, specifically for
1.creating models,
2.uploading files,
3.retrieving model versions.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.#ctor(System.String,Microsoft.Extensions.Logging.ILogger,System.Net.Http.HttpClient,System.Net.Http.HttpClient,System.Action{System.Net.Http.HttpRequestMessage})
Initializes a new instance of the Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi class with the specified base URL.
environmentUrl: The base URL for the Bim Model Data Product
logger: The logger to use for logging messages.
httpClient: Optional. The httpClient to be used to make http requests other than file operations.
fileOperationHttpClient: Optional. The httpClient to be used to make file operation related http requests.
reportContextSetter: Optional. Action to set report context headers.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.GetDataProductMetadata(System.Threading.CancellationToken)
Retrieve the metadata information for all available data products.
cancellationToken: Optional.
Returns: Metadata for all available data products. The schema can be found at: Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.environmentUrl/index.schema.json.
Throws System.Net.Http.HttpRequestException: Exception occurred when getting the metadata

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.CreateModelAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest,System.Threading.CancellationToken)
Creates a new model in the Bim Model Data Product and uploads a file as its first version.
Model creation will remain in a pending state until the file upload is completed successfully.
accessToken: Trimble access token used for authentication.
region: Region of data storage to connect.
createModelRequest: The information required for model creation.
cancellationToken: Optional.
Returns:
The created model ID if creation and upload are successful; otherwise, null.
Throws System.Net.Http.HttpRequestException: Exception occurred when creating the model
Throws Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException: Exception occurred when the TS version is not supported by the data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.ListModelsAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,Tekla.Structures.ModelInternal.BimModelDataProduct.ListModelOptions,System.String,System.Threading.CancellationToken)
Retrieves a paginated list of all available models, with optional filters.
accessToken: Trimble access token used for authentication.
region: Region of data storage to connect.
options: Optional. A set of filters to apply to the search.
cursor: Optional. The cursor for retrieving the next page of results.
cancellationToken: The cancellation token.
Returns: A page of model summary results, which includes the list of models and a cursor for the next page.
Throws System.Net.Http.HttpRequestException: Exception occurred when fetching available cloud models
Throws Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException: Exception occurred when the TS version is not supported by the data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.GetModelVersionsAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,System.String,System.String,System.Threading.CancellationToken)
Retrieves a paginated list of versions for a specific model.
accessToken: The Trimble access token used for authentication.
region: Region of data storage to connect.
modelId: The unique identifier of the model whose versions are to be retrieved.
cursor: Optional. A cursor for pagination.
cancellationToken: Optional.
Returns:
A Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionListPage containing the list of model versions and a cursor for the next page if available; otherwise, null if the operation fails.
Throws System.Net.Http.HttpRequestException: Exception occurred when fetching available version of the cloud model
Throws Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException: Exception occurred when the TS version is not supported by the data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.GetModelVersionAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,System.String,System.String,System.String,System.String,System.Threading.CancellationToken)
Retrieves details of a specific model version, with optional download and upload information.
accessToken: The Trimble access token used for authentication.
region: Region of data storage to connect.
modelId: The unique identifier of the model whose versions are to be retrieved.
versionId: The identifier of the version to retrieve.
download: Optional. The format of the file to download.
upload: Optional. The format of the file to upload.
cancellationToken: Optional cancellation token.
Returns:  A Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionResponse containing the retrieved model version; null if the operation fails.
Throws System.Net.Http.HttpRequestException: Exception occurred when fetching information for the model version
Throws Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException: Exception occurred when the TS version is not supported by the data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.UpdateModelAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelUpdateDto,System.Threading.CancellationToken)
Asynchronously updates a BIM model in the Bim Model Data Product.
accessToken: The Trimble access token used for authentication.
region: Region of data storage to connect.
modelId: The model identifier.
modelUpdate: The content of the update.
cancellationToken: Optional http request cancellation token.
Returns: An Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary object representing the updated model if the update is successful; otherwise, null.
Throws System.Net.Http.HttpRequestException: Exception occurred when updating the cloud model
Throws Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException: Exception occurred when the TS version is not supported by the data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.DeleteModelAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,System.String,System.String,System.Threading.CancellationToken)
Asynchronously deletes a BIM model from the Bim Model Data Product.
accessToken: The Trimble access token used for authentication.
region: Region of data storage to connect.
modelId: The unique identifier of the model to delete.
immediate:
If true, the model is deleted immediately. Otherwise, the model is marked for deletion and may be deleted later.
cancellationToken: Optional.
Returns: true if the delete operation is successful, otherwise false.
Throws System.ArgumentException: Thrown when modelId is null or empty.
Throws System.Net.Http.HttpRequestException: Exception occurred when deleting the cloud model
Throws Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException: Exception occurred when the TS version is not supported by the data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.CreateModelVersionAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitDto,System.Threading.CancellationToken)
Creates a new version for an existing model.
accessToken: The Trimble access token used for authentication.
region: Region of data storage to connect.
modelId: The model identifier.
modelVersionInit: The model version creation information
cancellationToken: Optional http request cancellation token.
Returns:
A Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitResponse containing the details of the initialized model version if successful; otherwise, null if the operation fails.
Throws System.Net.Http.HttpRequestException: Exception occurred when creating a cloud model
Throws Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException: Exception occurred when the TS version is not supported by the data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.GetModelAccessPageAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,System.String,System.String,System.Threading.CancellationToken)
Retrieves a paginated list of access control entries for a specific model.
modelId: The unique identifier of the model whose access control list is to be retrieved.
region: Region of data storage to connect.
cursor: Optional. A cursor for pagination to retrieve the paged results.
accessToken: The Trimble access token used for authentication.
cancellationToken: Optional. Cancellation token.
Returns:
An Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.AccessControlListPage containing the list of access control entries and a cursor for the next page if available; otherwise, null if the operation fails.
Throws System.Net.Http.HttpRequestException: Exception occurred when fetching available cloud models
Throws Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException: Exception occurred when the TS version is not supported by the data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.UpdateModelAccessAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.AccessControlListUpdate,System.String,System.Threading.CancellationToken)
Updates the access control list for a specific model.
Required user permission: admin access to the model.
Allowed operations:
1. Add new access entries.
2. Update existing access entries.
3. Remove access entries.
modelId: The unique identifier of the model whose access control list is to be updated.
region: Region of data storage to connect.
accessUpdate: The access control list update information, including entries to add, update, or remove.
accessToken: The Trimble access token used for authentication.
cancellationToken: Optional.Cancellation requests.
Returns: true if the update operation is successful, otherwise false.
Throws System.Net.Http.HttpRequestException: Exception occurred when updating the cloud models
Throws Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException: Exception occurred when the TS version is not supported by the data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.UploadFileAsync(Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.FileOperation,System.IO.Stream,System.Threading.CancellationToken,System.IProgress{System.Int64})
This method allows to upload files to a created model.
upload: FileOperation information from API to enable to upload of the file. Contains the file upload url
stream: Stream of the content to be uploaded
cancellationToken: Optional.Cancellation requests.
progress: Optional progress reporting.
Returns: true if the upload was successful, otherwise false.
Throws System.Net.Http.HttpRequestException: Exception occurred when updating the cloud models

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductApi.GetDataProductURL(Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion)
Data product Urls are created as follows {environmentUrl}/{region}/{productName}
region: Region for the Url
Returns: Fully formed url for Data Product API requests